app/views/posts/_post.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---
  <% if request.original_fullpath == posts_path %>
    <h1 class="username" >@<%= User.find_by(id: user_id).username %></h1>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---

    <h1 class="username" >@<%= User.find_by(id: user_id).username %></h1>