app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Post!"], ["description", "Cool"], ["created_at", "2023-07-06 06:10:09.373399"], ["updated_at", "2023-07-06 06:10:09.373399"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "ddddddjd"], ["updated_at", "2023-08-05 06:26:29.813560"], ["id", 1]]