app/models/user.rb

SELECT `users`.* FROM `users` WHERE (lower(username) = 'jtpham911@gmail.com' OR lower(email) = 'jtpham911@gmail.com') ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE (lower(username) = 'josh' OR lower(email) = 'josh') ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.find_for_database_authentication(warden_condition)
    conditions = warden_condition.dup
    if (login = conditions.delete(:login))
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { value: login.downcase }]).first